source_file_path = '/Users/fiona/Library/Mobile Documents/com~apple~CloudDocs/PHD/Research:Lab/Howe lab/GreekLatinTranslation/PH2219 - IG II2 1_LatinTEST.txt'
new_file_path = '/Users/fiona/Library/Mobile Documents/com~apple~CloudDocs/PHD/Research:Lab/Howe lab/GreekLatinTranslation/PH2219 - IG II2 1_Latin.txt'






def greekProxies(str):
    # Define a dictionary mapping Greek characters (both uppercase and lowercase) to Latin equivalents
    eqv = {
        'α': 'A', '𝛂': 'A', '𝛼': 'A', '𝜶': 'A', '𝝰': 'A', '𝞪': 'A',
        'Α': 'A', '𝚨': 'A', '𝛢': 'A', '𝜜': 'A', '𝝖': 'A', '𝞐': 'A', 
        'ἀ': 'A', 'Ἀ': 'A', 'ἄ': 'A', 'Ἄ': 'A', 'ᾄ': 'A', 'ᾌ': 'A', 
        'ἂ': 'A', 'Ἂ': 'A', 'ᾂ': 'A', 'ᾊ': 'A', 'ἆ': 'A', 'Ἆ': 'A', 
        'ᾆ': 'A', 'ᾎ': 'A', 'ᾀ': 'A', 'ᾈ': 'A', 'ἁ': 'A', 'Ἁ': 'A', 
        'ἅ': 'A', 'Ἅ': 'A', 'ᾅ': 'A', 'ᾍ': 'A', 'ἃ': 'A', 'Ἃ': 'A', 
        'ᾃ': 'A', 'ᾋ': 'A', 'ἇ': 'A', 'Ἇ': 'A', 'ᾇ': 'A', 'ᾏ': 'A', 
        'ᾁ': 'A', 'ᾉ': 'A', 'ά': 'A', 'ά': 'A', 'Ά': 'A', 'Ά': 'A', 
        'ᾴ': 'A', 'ὰ': 'A', 'Ὰ': 'A', 'ᾲ': 'A', 'ᾰ': 'A', 'Ᾰ': 'A', 
        'ᾶ': 'A', 'ᾷ': 'A', 'ᾱ': 'A', 'Ᾱ': 'A', 'ᾳ': 'A', 'ᾼ': 'A', 
        'ά': 'A',

        'β': 'B', 'ϐ': 'B', '𝛃': 'B', '𝛽': 'B', '𝜷': 'B', '𝝱': 'B', 
        '𝞫': 'B', 'Β': 'B', '𝚩': 'B', '𝛣': 'B', '𝜝': 'B', '𝝗': 'B', 
        '𝞑': 'B', 'ᵝ': 'B', 'ᵦ': 'B', 

        'γ': 'G', 'ℽ': 'G', '𝛄': 'G', '𝛾': 'G', '𝜸': 'G', '𝝲': 'G', 
        '𝞬': 'G', 'Γ': 'G', 'ℾ': 'G', '𝚪': 'G', '𝛤': 'G', '𝜞': 'G', 
        '𝝘': 'G', '𝞒': 'G', 'ᵞ': 'G', 'ᵧ': 'G', 'ᴦ': 'G', 

        'δ': 'D', '𝛅': 'D', '𝛿': 'D', '𝜹': 'D', '𝝳': 'D', '𝞭': 'D', 
        'Δ': 'D', '𝚫': 'D', '𝛥': 'D', '𝜟': 'D', '𝝙': 'D', '𝞓': 'D', 
        'ᵟ': 'D', 

        'ε': 'E', 'ϵ': 'E', '𝛆': 'E', '𝛜': 'E', '𝜀': 'E', '𝜖': 'E',
        '𝜺': 'E', '𝝐': 'E', '𝝴': 'E', '𝞊': 'E', '𝞮': 'E', '𝟄': 'E',
        'Ε': 'E', '𝚬': 'E', '𝛦': 'E', '𝜠': 'E', '𝝚': 'E', '𝞔': 'E',
        'ἐ': 'E', 'Ἐ': 'E', 'ἔ': 'E', 'Ἔ': 'E', 'ἒ': 'E', 'Ἒ': 'E',
        'ἑ': 'E', 'Ἑ': 'E', 'ἕ': 'E', 'Ἕ': 'E', 'ἓ': 'E', 'Ἓ': 'E',
        'έ': 'E', 'έ': 'E', 'Έ': 'E', 'Έ': 'E', 'ὲ': 'E', 'Ὲ': 'E',
        'έ': 'E',

        'ζ': 'Z', '𝛇': 'Z', '𝜁': 'Z', '𝜻': 'Z', '𝝵': 'Z', '𝞯': 'Z', 
        'Ζ': 'Z', '𝚭': 'Z', '𝛧': 'Z', '𝜡': 'Z', '𝝛': 'Z', '𝞕': 'Z', 

        'η': 'H', '𝛈': 'H', '𝜂': 'H', '𝜼': 'H', '𝝶': 'H', '𝞰': 'H', 
        'Η': 'H', '𝚮': 'H', '𝛨': 'H', '𝜢': 'H', '𝝜': 'H', '𝞖': 'H', 
        'ἠ': 'H', 'Ἠ': 'H', 'ἤ': 'H', 'Ἤ': 'H', 'ᾔ': 'H', 'ᾜ': 'H', 
        'ἢ': 'H', 'Ἢ': 'H', 'ᾒ': 'H', 'ᾚ': 'H', 'ἦ': 'H', 'Ἦ': 'H', 
        'ᾖ': 'H', 'ᾞ': 'H', 'ᾐ': 'H', 'ᾘ': 'H', 'ἡ': 'H', 'Ἡ': 'H', 
        'ἥ': 'H', 'Ἥ': 'H', 'ᾕ': 'H', 'ᾝ': 'H', 'ἣ': 'H', 'Ἣ': 'H', 
        'ᾓ': 'H', 'ᾛ': 'H', 'ἧ': 'H', 'Ἧ': 'H', 'ᾗ': 'H', 'ᾟ': 'H', 
        'ᾑ': 'H', 'ᾙ': 'H', 'ή': 'H', 'ή': 'H', 'Ή': 'H', 'Ή': 'H', 
        'ῄ': 'H', 'ὴ': 'H', 'Ὴ': 'H', 'ῂ': 'H', 'ῆ': 'H', 'ῇ': 'H', 
        'ῃ': 'H', 'ῌ': 'H', 'ή': 'H',

        'θ': 'Q', 'ϑ': 'Q', '𝛉': 'Q', '𝛝': 'Q', '𝜃': 'Q', '𝜗': 'Q', 
        '𝜽': 'Q', '𝝑': 'Q', '𝝷': 'Q', '𝞋': 'Q', '𝞱': 'Q', '𝟅': 'Q', 
        'Θ': 'Q', 'ϴ': 'Q', '𝚯': 'Q', '𝚹': 'Q', '𝛩': 'Q', '𝛳': 'Q', 
        '𝜣': 'Q', '𝜭': 'Q', '𝝝': 'Q', '𝝧': 'Q', '𝞗': 'Q', '𝞡': 'Q', 
        'ᶿ': 'Q', 

        'ι': 'I', 'ι': 'I', 'ͺ': 'I', '𝛊': 'I', '𝜄': 'I', '𝜾': 'I', 
        '𝝸': 'I', '𝞲': 'I', 'Ι': 'I', '𝚰': 'I', '𝛪': 'I', '𝜤': 'I', 
        '𝝞': 'I', '𝞘': 'I', 'ἰ': 'I', 'Ἰ': 'I', 'ἴ': 'I', 'Ἴ': 'I', 
        'ἲ': 'I', 'Ἲ': 'I', 'ἶ': 'I', 'Ἶ': 'I', 'ἱ': 'I', 'Ἱ': 'I', 
        'ἵ': 'I', 'Ἵ': 'I', 'ἳ': 'I', 'Ἳ': 'I', 'ἷ': 'I', 'Ἷ': 'I', 
        'ί': 'I', 'ί': 'I', 'Ί': 'I', 'Ί': 'I', 'ὶ': 'I', 'Ὶ': 'I', 
        'ῐ': 'I', 'Ῐ': 'I', 'ῖ': 'I', 'ϊ': 'I', 'Ϊ': 'I', 'ΐ': 'I', 
        'ΐ': 'I', 'ῒ': 'I', 'ῗ': 'I', 'ῑ': 'I', 'Ῑ': 'I', 'ί': 'I',

        'κ': 'K', 'ϰ': 'K', '𝛋': 'K', '𝛞': 'K', '𝜅': 'K', '𝜘': 'K', 
        '𝜿': 'K', '𝝒': 'K', '𝝹': 'K', '𝞌': 'K', '𝞳': 'K', '𝟆': 'K', 
        'Κ': 'K', '𝚱': 'K', '𝛫': 'K', '𝜥': 'K', '𝝟': 'K', '𝞙': 'K', 
        'ϗ': 'K', 'Ϗ': 'K', 

        'λ': 'L', '𝛌': 'L', '𝜆': 'L', '𝝀': 'L', '𝝺': 'L', '𝞴': 'L', 
        'Λ': 'L', '𝚲': 'L', '𝛬': 'L', '𝜦': 'L', '𝝠': 'L', '𝞚': 'L', 
        'ᴧ': 'L', 

        'μ': 'M', 'µ': 'M', '𝛍': 'M', '𝜇': 'M', '𝝁': 'M', '𝝻': 'M', 
        '𝞵': 'M', 'Μ': 'M', '𝚳': 'M', '𝛭': 'M', '𝜧': 'M', '𝝡': 'M', 
        '𝞛': 'M', '㎂': 'M', '㎌': 'M', '㎍': 'M', '㎕': 'M', '㎛': 'M', 
        '㎲': 'M', '㎶': 'M', '㎼': 'M', 

        'ν': 'N', '𝛎': 'N', '𝜈': 'N', '𝝂': 'N', '𝝼': 'N', '𝞶': 'N', 
        'Ν': 'N', '𝚴': 'N', '𝛮': 'N', '𝜨': 'N', '𝝢': 'N', '𝞜': 'N', 

        'ξ': 'X', '𝛏': 'X', '𝜉': 'X', '𝝃': 'X', '𝝽': 'X', '𝞷': 'X', 
        'Ξ': 'X', '𝚵': 'X', '𝛯': 'X', '𝜩': 'X', '𝝣': 'X', '𝞝': 'X', 

        'ο': 'O', '𝛐': 'O', '𝜊': 'O', '𝝄': 'O', '𝝾': 'O', '𝞸': 'O', 
        'Ο': 'O', '𝚶': 'O', '𝛰': 'O', '𝜪': 'O', '𝝤': 'O', '𝞞': 'O', 
        'ὀ': 'O', 'Ὀ': 'O', 'ὄ': 'O', 'Ὄ': 'O', 'ὂ': 'O', 'Ὂ': 'O', 
        'ὁ': 'O', 'Ὁ': 'O', 'ὅ': 'O', 'Ὅ': 'O', 'ὃ': 'O', 'Ὃ': 'O', 
        'ό': 'O', 'ό': 'O', 'Ό': 'O', 'Ό': 'O', 'ὸ': 'O', 'Ὸ': 'O', 
        'ό': 'O',

        'π': 'P', 'ϖ': 'P', 'ℼ': 'P', '𝛑': 'P', '𝛡': 'P', '𝜋': 'P', 
        '𝜛': 'P', '𝝅': 'P', '𝝕': 'P', '𝝿': 'P', '𝞏': 'P', '𝞹': 'P', 
        '𝟉': 'P', 'Π': 'P', 'ℿ': 'P', '𝚷': 'P', '𝛱': 'P', '𝜫': 'P', 
        '𝝥': 'P', '𝞟': 'P', 'ᴨ': 'P', 

        'ρ': 'R', 'ϱ': 'R', '𝛒': 'R', '𝛠': 'R', '𝜌': 'R', '𝜚': 'R', 
        '𝝆': 'R', '𝝔': 'R', '𝞀': 'R', '𝞎': 'R', '𝞺': 'R', '𝟈': 'R', 
        'Ρ': 'R', '𝚸': 'R', '𝛲': 'R', '𝜬': 'R', '𝝦': 'R', '𝞠': 'R', 
        'ᵨ': 'R', 'ῤ': 'R', 'ῥ': 'R', 'Ῥ': 'R', 'ᴩ': 'R', 'ϼ': 'R', 

        'σ': 'S', 'ϲ': 'S', '𝛓': 'S', '𝛔': 'S', '𝜍': 'S', '𝜎': 'S', 
        '𝝇': 'S', '𝝈': 'S', '𝞁': 'S', '𝞂': 'S', '𝞻': 'S', '𝞼': 'S', 
        'Σ': 'S', 'Ϲ': 'S', '𝚺': 'S', '𝛴': 'S', '𝜮': 'S', '𝝨': 'S', 
        '𝞢': 'S', 'ς': 'S', 

        'τ': 'T', '𝛕': 'T', '𝜏': 'T', '𝝉': 'T', '𝞃': 'T', '𝞽': 'T', 
        'Τ': 'T', '𝚻': 'T', '𝛵': 'T', '𝜯': 'T', '𝝩': 'T', '𝞣': 'T', 

        'υ': 'Y', '𝛖': 'Y', '𝜐': 'Y', '𝝊': 'Y', '𝞄': 'Y', '𝞾': 'Y', 
        'Υ': 'Y', 'ϒ': 'Y', '𝚼': 'Y', '𝛶': 'Y', '𝜰': 'Y', '𝝪': 'Y', 
        '𝞤': 'Y', 'ὐ': 'Y', 'ὔ': 'Y', 'ὒ': 'Y', 'ὖ': 'Y', 'ὑ': 'Y', 
        'Ὑ': 'Y', 'ὕ': 'Y', 'Ὕ': 'Y', 'ὓ': 'Y', 'Ὓ': 'Y', 'ὗ': 'Y', 
        'Ὗ': 'Y', 'ύ': 'Y', 'ύ': 'Y', 'Ύ': 'Y', 'Ύ': 'Y', 'ϓ': 'Y', 
        'ὺ': 'Y', 'Ὺ': 'Y', 'ῠ': 'Y', 'Ῠ': 'Y', 'ῦ': 'Y', 'ϋ': 'Y', 
        'Ϋ': 'Y', 'ϔ': 'Y', 'ΰ': 'Y', 'ΰ': 'Y', 'ῢ': 'Y', 'ῧ': 'Y', 
        'ῡ': 'Y', 'Ῡ': 'Y', 'ύ': 'Y',

        'φ': 'F', 'ϕ': 'F', '𝛗': 'F', '𝛟': 'F', '𝜑': 'F', '𝜙': 'F', 
        '𝝋': 'F', '𝝓': 'F', '𝞅': 'F', '𝞍': 'F', '𝞿': 'F', '𝟇': 'F', 
        'Φ': 'F', '𝚽': 'F', '𝛷': 'F', '𝜱': 'F', '𝝫': 'F', '𝞥': 'F', 
        'ᵠ': 'F', 'ᵩ': 'F', 

        'χ': 'C', '𝛘': 'C', '𝜒': 'C', '𝝌': 'C', '𝞆': 'C', '𝟀': 'C', 
        'Χ': 'C', '𝚾': 'C', '𝛸': 'C', '𝜲': 'C', '𝝬': 'C', '𝞦': 'C', 
        'ᵡ': 'C', 'ᵪ': 'C', 

        'ψ': 'U', '𝛙': 'U', '𝜓': 'U', '𝝍': 'U', '𝞇': 'U', '𝟁': 'U', 
        'Ψ': 'U', '𝚿': 'U', '𝛹': 'U', '𝜳': 'U', '𝝭': 'U', '𝞧': 'U', 
        'ᴪ': 'U', 

        'ω': 'W', '𝛚': 'W', '𝜔': 'W', '𝝎': 'W', '𝞈': 'W', '𝟂': 'W', 
        'Ω': 'W', 'Ω': 'W', 'ꭥ': 'W', '𝛀': 'W', '𝛺': 'W', '𝜴': 'W', 
        '𝝮': 'W', '𝞨': 'W', 'ὠ': 'W', 'Ὠ': 'W', 'ὤ': 'W', 'Ὤ': 'W', 
        'ᾤ': 'W', 'ᾬ': 'W', 'ὢ': 'W', 'Ὢ': 'W', 'ᾢ': 'W', 'ᾪ': 'W', 
        'ὦ': 'W', 'Ὦ': 'W', 'ᾦ': 'W', 'ᾮ': 'W', 'ᾠ': 'W', 'ᾨ': 'W', 
        'ὡ': 'W', 'Ὡ': 'W', 'ὥ': 'W', 'Ὥ': 'W', 'ᾥ': 'W', 'ᾭ': 'W', 
        'ὣ': 'W', 'Ὣ': 'W', 'ᾣ': 'W', 'ᾫ': 'W', 'ὧ': 'W', 'Ὧ': 'W', 
        'ᾧ': 'W', 'ᾯ': 'W', 'ᾡ': 'W', 'ᾩ': 'W', 'ώ': 'W', 'ώ': 'W', 
        'Ώ': 'W', 'Ώ': 'W', 'ῴ': 'W', 'ὼ': 'W', 'Ὼ': 'W', 'ῲ': 'W', 
        'ῶ': 'W', 'ῷ': 'W', 'ῳ': 'W', 'ῼ': 'W', 'ꭥ': 'W', 'ώ': 'W'

        # 'Α': 'A', 'Β': 'B', 'Γ': 'G', 'Δ': 'D', 'Ε': 'E', 'Ζ': 'Z', 'Η': 'H',
        # 'Θ': 'Q', 'Ι': 'I', 'Κ': 'K', 'Λ': 'L', 'Μ': 'M', 'Ν': 'N', 'Ξ': 'X',
        # 'Ο': 'O', 'Π': 'P', 'Ρ': 'R', 'Σ': 'S', 'Τ': 'T', 'Υ': 'U', 'Φ': 'F',
        # 'Χ': 'C', 'Ψ': 'Y', 'Ω': 'W',
        # 'α': 'a', 'β': 'b', 'γ': 'g', 'δ': 'd', 'ε': 'e', 'ζ': 'z', 'η': 'h',
        # 'θ': 'q', 'ι': 'i', 'κ': 'k', 'λ': 'l', 'μ': 'm', 'ν': 'n', 'ξ': 'x',
        # 'ο': 'o', 'π': 'p', 'ρ': 'r', 'σ': 's', 'ς': 's', 'τ': 't', 'υ': 'u',
        # 'φ': 'f', 'χ': 'c', 'ψ': 'y', 'ω': 'w',
        # 'ά': 'a', 'έ': 'e', 'ή': 'h', 'ί': 'i', 'ό': 'o', 'ύ': 'u', 'ώ': 'w',
        # 'ϊ': 'i', 'ϋ': 'u', 'ΐ': 'i', 'ΰ': 'u',
        # 'ἀ': 'a', 'ἁ': 'a', 'ἂ': 'a', 'ἃ': 'a', 'ἄ': 'a', 'ἅ': 'a', 'ἆ': 'a', 'ἇ': 'a',
        # 'ἐ': 'e', 'ἑ': 'e', 'ἒ': 'e', 'ἓ': 'e', 'ἔ': 'e', 'ἕ': 'e',
        # 'ἠ': 'h', 'ἡ': 'h', 'ἢ': 'h', 'ἣ': 'h', 'ἤ': 'h', 'ἥ': 'h', 'ἦ': 'h', 'ἧ': 'h',
        # 'ἰ': 'i', 'ἱ': 'i', 'ἲ': 'i', 'ἳ': 'i', 'ἴ': 'i', 'ἵ': 'i', 'ἶ': 'i', 'ἷ': 'i',
        # 'ὀ': 'o', 'ὁ': 'o', 'ὂ': 'o', 'ὃ': 'o', 'ὄ': 'o', 'ὅ': 'o',
        # 'ὐ': 'u', 'ὑ': 'u', 'ὒ': 'u', 'ὓ': 'u', 'ὔ': 'u', 'ὕ': 'u', 'ὖ': 'u', 'ὗ': 'u',
        # 'ὠ': 'w', 'ὡ': 'w', 'ὢ': 'w', 'ὣ': 'w', 'ὤ': 'w', 'ὥ': 'w', 'ὦ': 'w', 'ὧ': 'w',
        # 'ᾀ': 'a', 'ᾁ': 'a', 'ᾂ': 'a', 'ᾃ': 'a', 'ᾄ': 'a', 'ᾅ': 'a', 'ᾆ': 'a', 'ᾇ': 'a',
        # 'ᾐ': 'h', 'ᾑ': 'h', 'ᾒ': 'h', 'ᾓ': 'h', 'ᾔ': 'h', 'ᾕ': 'h', 'ᾖ': 'h', 'ᾗ': 'h',
        # 'ᾠ': 'w', 'ᾡ': 'w', 'ᾢ': 'w', 'ᾣ': 'w', 'ᾤ': 'w', 'ᾥ': 'w', 'ᾦ': 'w', 'ᾧ': 'w',
        # 'ᾰ': 'a', 'ᾱ': 'a', 'ᾲ': 'a', 'ᾳ': 'a', 'ᾴ': 'a', 'ᾶ': 'a', 'ᾷ': 'a',
        # 'ῂ': 'h', 'ῃ': 'h', 'ῄ': 'h', 'ῆ': 'h', 'ῇ': 'h',
        # 'ῐ': 'i', 'ῑ': 'i', 'ῒ': 'i', 'ΐ': 'i', 'ῖ': 'i', 'ῗ': 'i',
        # 'ῠ': 'u', 'ῡ': 'u', 'ῢ': 'u', 'ΰ': 'u', 'ῤ': 'r', 'ῥ': 'r',
        # 'ῤ': 'r', 'ῥ': 'r', 'ῦ': 'u', 'ῧ': 'u', 'ῲ': 'o', 'ῳ': 'o', 'ῴ': 'o', 'ῶ': 'o', 'ῷ': 'o', 'Ἀ': 'A', 
        # 'ί': 'i', 'ὺ': 'u', 'ὶ': 'i', 'ά': 'a', 'έ': 'e', 'ὰ': 'a', 'ή': 'h', 'ό': 'o', 'ώ': 'o', 'o͂': 'w',
        # 'ὴ': 'h', 'e͂': 'e', 'o͂': ''
    }

    txt = []
    for char in str:
        if char in eqv:
            txt.append(eqv[char])
        else:
            txt.append(char)
    return ''.join(txt)

# Test the function
# input_text = "Γειά σας, Κόσμε! αβγδε"
# output_text = greekProxies(input_text)
# print(output_text)

try:
    with open(source_file_path, 'r') as source_file:
        with open(new_file_path, 'w') as new_file:
            for line in source_file:
                line = greekProxies(line)
                new_file.write(line)
    
    print(f"File '{source_file_path}' copied to '{new_file_path}' successfully.")
except FileNotFoundError:
    print(f"File '{source_file_path}' not found.")
except Exception as e:
    print(f"An error occurred: {str(e)}")